-
# Типы данных
# int - целые числа
# float - числа с плавающей точкой
# str - строки


# Есть строка с перечислением песен

my_favorite_songs = 'Waste a Moment, Staying\' Alive, A Sorta Fairytale, Start Me Up, New Salvation'
# str() - строки

# Выведите на консоль с помощью индексации строки, последовательно: первый трек, последний, второй, второй с конца
# Нельзя переопределять my_favorite_songs и запятая не должна выводиться.


 
      
      
      



# Сколикова Вера
# Алексеева Мила
# Дубровский Даниил