# ##### Вариант 1
# Создайте список списков населения любых городов
# Количество элементов в списке "города" не меньше 3!

# Выведите на консоль население второго города в списке в формате
# Население Москвы - ХХ человек

# Выведите на консоль общий размер населения перечисленных городов как сумму населения всех городов
# Итого размер населения - ХХ человек

# ##### Вариант 2
# Есть список из чисел
# найдите сумму только положительных чисел в нем.

# Например,
# [1,-4,7,12] -> 1 + 7 + 12 = 20

# Примечание: 
# если положительных чисел в списке нет, то сумма равна 0.














